---
type: FabricationConfigurationInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# FabricationConfigurationInfo

`Autodesk.Revit.DB.FabricationConfigurationInfo` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | FindSourceFabricationConfiguration | 2016 | `public static FabricationConfigurationInfo FindSourceFabricationConfiguration ( FabricationConfigurationInfo fabricationConfiguration )` |
| Method | GetAllFabricationConfigurations | 2016 | `public static IList < FabricationConfigurationInfo > GetAllFabricationConfigurations ()` |
| Method | GetProfiles | 2016 | `public IList < string > GetProfiles ()` |
| Method | IsValid | 2016 | `public bool IsValid ()` |
| Property | CloudId | 2019 | `public string CloudId { get ; }` |
| Property | Description | 2016 | `public string Description { get ; }` |
| Property | GUID | 2016 | `public Guid GUID { get ; }` |
| Property | IsCloudConfiguration | 2019 | `public bool IsCloudConfiguration { get ; }` |
| Property | IsLocked | 2016 | `public bool IsLocked { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2016 | `public string Name { get ; }` |
| Property | Path | 2016 | `public string Path { get ; }` |
| Property | UnitSystem | 2016 | `public UnitSystem UnitSystem { get ; }` |
| Property | Version | 2016 | `public double Version { get ; }` |